# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\enes_\Documents\PSoC Creator\Intern_WorkSpace\Staj_Mouse_HID_Project.cydsn\Staj_Mouse_HID_Project.cyprj
# Date: Fri, 18 Aug 2023 13:26:27 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyPLL0} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pll_0}]]
create_clock -name {CyClk_HF3} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk_3}]]
create_clock -name {CyFLL} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_generated_clock -name {CapSense_ModClk} -source [get_pins {ClockBlock/periclk}] -edges {1 255 511} [list [get_pins {ClockBlock/ff_div_43}]]
create_generated_clock -name {USBFS_busRstClk} -source [get_pins {ClockBlock/periclk}] -edges {1 501 1001} [list [get_pins {ClockBlock/ff_div_50}]]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/periclk}] -edges {1 51 101} [list [get_pins {ClockBlock/ff_div_12}]]
create_clock -name {CyPeriClk_App} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for C:\Users\enes_\Documents\PSoC Creator\Intern_WorkSpace\Staj_Mouse_HID_Project.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\enes_\Documents\PSoC Creator\Intern_WorkSpace\Staj_Mouse_HID_Project.cydsn\Staj_Mouse_HID_Project.cyprj
# Date: Fri, 18 Aug 2023 13:26:10 GMT
